{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 256,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 256
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 1,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</s>",
      2
    ],
    "cls": [
      "<s>",
      0
    ],
    "trim_offsets": true,
    "add_prefix_space": false
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "¨": 106,
      "©": 107,
      "ª": 108,
      "«": 109,
      "¬": 110,
      "®": 111,
      "¯": 112,
      "°": 113,
      "±": 114,
      "²": 115,
      "³": 116,
      "´": 117,
      "µ": 118,
      "¶": 119,
      "·": 120,
      "¸": 121,
      "¹": 122,
      "º": 123,
      "»": 124,
      "¼": 125,
      "½": 126,
      "¾": 127,
      "¿": 128,
      "À": 129,
      "Á": 130,
      "Â": 131,
      "Ã": 132,
      "Ä": 133,
      "Å": 134,
      "Æ": 135,
      "Ç": 136,
      "È": 137,
      "É": 138,
      "Ê": 139,
      "Ë": 140,
      "Ì": 141,
      "Í": 142,
      "Î": 143,
      "Ï": 144,
      "Ð": 145,
      "Ñ": 146,
      "Ò": 147,
      "Ó": 148,
      "Ô": 149,
      "Õ": 150,
      "Ö": 151,
      "×": 152,
      "Ø": 153,
      "Ù": 154,
      "Ú": 155,
      "Û": 156,
      "Ü": 157,
      "Ý": 158,
      "Þ": 159,
      "ß": 160,
      "à": 161,
      "á": 162,
      "â": 163,
      "ã": 164,
      "ä": 165,
      "å": 166,
      "æ": 167,
      "ç": 168,
      "è": 169,
      "é": 170,
      "ê": 171,
      "ë": 172,
      "ì": 173,
      "í": 174,
      "î": 175,
      "ï": 176,
      "ð": 177,
      "ñ": 178,
      "ò": 179,
      "ó": 180,
      "ô": 181,
      "õ": 182,
      "ö": 183,
      "÷": 184,
      "ø": 185,
      "ù": 186,
      "ú": 187,
      "û": 188,
      "ü": 189,
      "ý": 190,
      "þ": 191,
      "ÿ": 192,
      "Ā": 193,
      "ā": 194,
      "Ă": 195,
      "ă": 196,
      "Ą": 197,
      "ą": 198,
      "Ć": 199,
      "ć": 200,
      "Ĉ": 201,
      "ĉ": 202,
      "Ċ": 203,
      "ċ": 204,
      "Č": 205,
      "č": 206,
      "Ď": 207,
      "ď": 208,
      "Đ": 209,
      "đ": 210,
      "Ē": 211,
      "ē": 212,
      "Ĕ": 213,
      "ĕ": 214,
      "Ė": 215,
      "ė": 216,
      "Ę": 217,
      "ę": 218,
      "Ě": 219,
      "ě": 220,
      "Ĝ": 221,
      "ĝ": 222,
      "Ğ": 223,
      "ğ": 224,
      "Ġ": 225,
      "ġ": 226,
      "Ģ": 227,
      "ģ": 228,
      "Ĥ": 229,
      "ĥ": 230,
      "Ħ": 231,
      "ħ": 232,
      "Ĩ": 233,
      "ĩ": 234,
      "Ī": 235,
      "ī": 236,
      "Ĭ": 237,
      "ĭ": 238,
      "Į": 239,
      "į": 240,
      "İ": 241,
      "ı": 242,
      "Ĳ": 243,
      "ĳ": 244,
      "Ĵ": 245,
      "ĵ": 246,
      "Ķ": 247,
      "ķ": 248,
      "ĸ": 249,
      "Ĺ": 250,
      "ĺ": 251,
      "Ļ": 252,
      "ļ": 253,
      "Ľ": 254,
      "ľ": 255,
      "Ŀ": 256,
      "ŀ": 257,
      "Ł": 258,
      "ł": 259,
      "Ń": 260,
      "cc": 261,
      "CC": 262,
      "(=": 263,
      "ccc": 264,
      "Cc": 265,
      "+]": 266,
      "CCC": 267,
      "ccccc": 268,
      "NH": 269,
      "NC": 270,
      "OC": 271,
      "nc": 272,
      "CCCC": 273,
      ")(": 274,
      "Cl": 275,
      "cccc": 276,
      "Oc": 277,
      "Nc": 278,
      ")[": 279,
      "-]": 280,
      "-])": 281,
      "OCC": 282,
      "COc": 283,
      ")(=": 284,
      "([": 285,
      "nH": 286,
      ")=": 287,
      "Br": 288,
      "CCN": 289,
      "+](": 290,
      "CN": 291,
      "cn": 292,
      "CCCCC": 293,
      "CCc": 294,
      "COC": 295,
      "+])": 296,
      "sc": 297,
      "CO": 298,
      "12": 299,
      "nn": 300,
      "NCC": 301,
      "ncc": 302,
      "CS": 303,
      "CCOC": 304,
      "+](=": 305,
      "21": 306,
      "oc": 307,
      "cnc": 308,
      "CNC": 309,
      "NCc": 310,
      "CCCCCCCC": 311,
      "nnc": 312,
      "CCOCC": 313,
      "OCc": 314,
      "Cn": 315,
      "CCOc": 316,
      "CCCN": 317,
      "COCC": 318,
      "CCNC": 319,
      "SC": 320,
      "cccnc": 321,
      "23": 322,
      "32": 323,
      "CCO": 324,
      "CSc": 325,
      "CCS": 326,
      "ccnc": 327,
      "NS": 328,
      "CCCCCC": 329,
      "Si": 330,
      "cccs": 331,
      "CCn": 332,
      "CNc": 333,
      "NN": 334,
      "ccn": 335,
      "](": 336,
      ")=[": 337,
      "+]=": 338,
      "Sc": 339,
      "csc": 340,
      "ccccn": 341,
      "cnn": 342,
      "CCCc": 343,
      "CCCO": 344,
      "ccco": 345,
      "cs": 346,
      "NCCC": 347,
      "ncnc": 348,
      "ccncc": 349,
      "SCC": 350,
      "no": 351,
      "=[": 352,
      "noc": 353,
      "NNC": 354,
      "nccc": 355,
      "NCCc": 356,
      "OCCC": 357,
      "ncn": 358,
      "CCCNC": 359,
      ")([": 360,
      "OCO": 361,
      "OCCO": 362,
      "cncc": 363,
      "ccsc": 364,
      "ncccc": 365,
      "CCCOc": 366,
      "34": 367,
      "43": 368,
      "CCl": 369,
      "CSC": 370,
      "CCNc": 371,
      "CCCCCCC": 372,
      "CCCCN": 373,
      "SCc": 374,
      "cccn": 375,
      "OCCOCC": 376,
      "CCCn": 377,
      "sccc": 378,
      "(=[": 379,
      "COCc": 380,
      "Fc": 381,
      "+]([": 382,
      "CCCCCCCCC": 383,
      "CCCOC": 384,
      "OCCCC": 385,
      "on": 386,
      "CCCS": 387,
      "CBr": 388,
      "CCCCCCCCCCCCCCCC": 389,
      "CCSC": 390,
      "-])[": 391,
      "CNS": 392,
      "CCCCO": 393,
      "nccn": 394,
      "CCCCc": 395,
      "Clc": 396,
      "CCCNc": 397,
      "nccs": 398,
      "NO": 399,
      "COP": 400,
      "coc": 401,
      "ccoc": 402,
      "FC": 403,
      "cncn": 404,
      "CCSc": 405,
      "CSCC": 406,
      "54": 407,
      "COCCN": 408,
      ")-": 409,
      "OP": 410,
      "CCCCOc": 411,
      "CCCCNC": 412,
      "13": 413,
      "ccnn": 414,
      "nnn": 415,
      "ncccn": 416,
      "-])=": 417,
      "cnccc": 418,
      "NCCCC": 419,
      "CCSCC": 420,
      "COCCC": 421,
      "NNc": 422,
      "nnnn": 423,
      "OS": 424,
      "scc": 425,
      "CCCCCCCCCCCC": 426,
      "CCNS": 427,
      "+])(": 428,
      "cnnc": 429,
      "45": 430,
      "CCCl": 431,
      "CCCCCCCCCC": 432,
      "cnccn": 433,
      "ON": 434,
      "OCCOC": 435,
      "OCCCO": 436,
      "nccnc": 437,
      "OCCc": 438,
      "onc": 439,
      "NCCNC": 440,
      "nnnc": 441,
      "CCCCOC": 442,
      "occc": 443,
      "10": 444,
      "CSCCC": 445,
      "NOC": 446,
      "CCCCCCCCCCC": 447,
      "NCCN": 448,
      "OCCN": 449,
      "OCCOc": 450,
      "Nn": 451,
      "31": 452,
      "Brc": 453,
      "CSCc": 454,
      "+]=[": 455,
      "CCCCn": 456,
      "ns": 457,
      "ncnn": 458,
      "NCCCc": 459,
      "-])(": 460,
      "nsc": 461,
      "cnnn": 462,
      "OO": 463,
      "OCCNC": 464,
      "CF": 465,
      "COCCNC": 466,
      "NCCOc": 467,
      "CCCCS": 468,
      "nncn": 469,
      "CON": 470,
      "co": 471,
      "CCCCCN": 472,
      "OCOC": 473,
      "OCCOCCOCCOCC": 474,
      "cncnc": 475,
      "cscn": 476,
      "NCCn": 477,
      "#[": 478,
      "CCCOCC": 479,
      "NCCO": 480,
      "COCCn": 481,
      "65": 482,
      "NCCCCC": 483,
      "][": 484,
      "NCCS": 485,
      "CCOP": 486,
      "11": 487,
      "-]#[": 488,
      "CCCCCCCCCCCCC": 489,
      "CP": 490,
      "ncsc": 491,
      "SCCC": 492,
      "CCCCCCCCCCCCCC": 493,
      "CCCCCNC": 494,
      "CCCCCc": 495,
      "OB": 496,
      "COCCOc": 497,
      "SiH": 498,
      "NCCCn": 499,
      "nonc": 500,
      "CCOCc": 501,
      "CCCCCOc": 502,
      "NCCOC": 503,
      "nncc": 504,
      "CCBr": 505,
      "CCCCCCCCCCCCCCC": 506,
      "CH": 507,
      "CCCSc": 508,
      "NCCCN": 509,
      "24": 510,
      "ccncn": 511,
      "Se": 512,
      "CCCCCCCCCCCCCCCCC": 513,
      "56": 514,
      "CCCCCCCCCCCCCCCCCC": 515,
      "NCCNc": 516,
      "cncs": 517,
      "scnc": 518,
      "OCCn": 519,
      "CCCCCCOc": 520,
      "COCCCNC": 521,
      "COCCOC": 522,
      "nsnc": 523,
      "OCCCCC": 524,
      "COCCO": 525,
      "CCCNS": 526,
      "ccon": 527,
      "OCCCCCC": 528,
      "CCCCl": 529,
      "CI": 530,
      "OCCCc": 531,
      "cscc": 532,
      "42": 533,
      "COCCCN": 534,
      "CCCSC": 535,
      "COS": 536,
      "nnsc": 537,
      "-]=[": 538,
      "CCCCCCc": 539,
      "sccn": 540,
      "cccnn": 541,
      "NOCC": 542,
      "ncncc": 543,
      "OCCCCCCCC": 544,
      "+])=": 545,
      "CNCC": 546,
      "CCCCNc": 547,
      "NCCCOC": 548,
      "OOC": 549,
      "NOCc": 550,
      "76": 551,
      "CCOCCC": 552,
      "NP": 553,
      "snc": 554,
      "OCCCNC": 555,
      "occ": 556,
      "SS": 557,
      "14": 558,
      "Sn": 559,
      "COCCCC": 560,
      "nncs": 561,
      "CCCCCCN": 562,
      "NCCOCC": 563,
      "NCCCCCC": 564,
      "COCCc": 565,
      "CCCCCO": 566,
      "](=": 567,
      "CCCCCOC": 568,
      "COCCOCC": 569,
      "NCCCO": 570,
      "cnoc": 571,
      "ncoc": 572,
      "CCCCCn": 573,
      "NCCCOCC": 574,
      "SCCS": 575,
      "COCCNc": 576,
      "ClC": 577,
      "+])[": 578,
      "OCCCOc": 579,
      "CONC": 580,
      "])": 581,
      "snnc": 582,
      "CCCCCCNC": 583,
      "NCCCNC": 584,
      "CCCCOCC": 585,
      "CCCCCCCCc": 586,
      "CCCCCCCCOc": 587,
      "sn": 588,
      "CCOCCCNC": 589,
      "CCCCCCCCCCCCCCCCCCC": 590,
      "-])([": 591,
      "NCCSCc": 592,
      "CSCCN": 593,
      "ccno": 594,
      "ncon": 595,
      "OCCS": 596,
      "CCF": 597,
      "ncco": 598,
      "35": 599,
      "CCCCCCCCCCCCCCCCCCCCC": 600,
      "NCCSc": 601,
      "OCCCCCCCCCCCC": 602,
      "OCCCOC": 603,
      "CCNCC": 604,
      "cnco": 605,
      "67": 606,
      "CCP": 607,
      "CCON": 608,
      "OCCCn": 609,
      "SCCN": 610,
      "CCSCc": 611,
      "OOO": 612,
      "Bc": 613,
      "NNS": 614,
      "NCCOCCOCC": 615,
      "CCCSCC": 616,
      "COCCOCCOCC": 617,
      "OCCOCCOCCOCCOCCOCCOCCOCC": 618,
      "csnn": 619,
      "CCOCCOc": 620,
      "CCOCCN": 621,
      "ccnnc": 622,
      "COCOc": 623,
      "ClCc": 624,
      "ocnc": 625,
      "CCCBr": 626,
      "NCCCOc": 627,
      "SCCCC": 628,
      "CNN": 629,
      "NCCNS": 630,
      "COCCCn": 631,
      "CNNC": 632,
      "CCCCCCCOc": 633,
      "OCCNc": 634,
      "CCCCCCOC": 635,
      "oncc": 636,
      "CCCCSc": 637,
      "CCSCCC": 638,
      "OCCCN": 639,
      "COCOC": 640,
      "CCOCCOC": 641,
      "53": 642,
      "SCCCS": 643,
      "ONC": 644,
      "CCOS": 645,
      "OCCOCCO": 646,
      "CCCCCNc": 647,
      "On": 648,
      "CCCCCCCc": 649,
      "-][": 650,
      "CCCOCc": 651,
      "-](": 652,
      "CCCCCCCCOC": 653,
      "As": 654,
      "87": 655,
      "CCOCCn": 656,
      "NCCSC": 657,
      "CCOCCO": 658,
      "CB": 659,
      "CSCCS": 660,
      "15": 661,
      "SOOO": 662,
      "CCCCCCO": 663,
      "Ic": 664,
      "cnns": 665,
      "SN": 666,
      "CSCN": 667,
      "CSSCC": 668,
      "NCCCS": 669,
      "CCOCCOCCOCC": 670,
      "OCCCl": 671,
      "CCCCCCn": 672,
      "CCCCCCCCN": 673,
      "OCCCCCCCCCC": 674,
      "OCCSc": 675,
      "CCCCCCCCCCCCCCCCCCCC": 676,
      "64": 677,
      "nnco": 678,
      "OCn": 679,
      "SCCOc": 680,
      "se": 681,
      "OCCCS": 682,
      "CCCCCl": 683,
      "CCCOCCC": 684,
      "CCCCCCCCCCOc": 685,
      "COCCCNc": 686,
      "41": 687,
      "BC": 688,
      "CCCF": 689,
      "BrC": 690,
      "COCCCOc": 691,
      "CCCCNS": 692,
      "CCCCCCCCCCCCOc": 693,
      "OCN": 694,
      "SCCc": 695,
      "NCN": 696,
      "CCCCCS": 697,
      "ClCC": 698,
      "SCCNC": 699,
      "ncns": 700,
      "SCCO": 701,
      "CCCCCCCN": 702,
      "SSc": 703,
      "CCCCCCCCCc": 704,
      "CCOCCCC": 705,
      "16": 706,
      "NNCC": 707,
      "Ge": 708,
      "OCOCC": 709,
      "OCOc": 710,
      "nnccc": 711,
      "CCCCCCCCCCCCc": 712,
      "CCOCCOCC": 713,
      "OCCOCCOC": 714,
      "OCCCCCCC": 715,
      "CCCCCCCCCCc": 716,
      "OCCCCOc": 717,
      "CCOCCCN": 718,
      "NCCCCc": 719,
      "COCCNS": 720,
      "NCCOCCO": 721,
      "NCCCNc": 722,
      "cnsn": 723,
      "CCONC": 724,
      "SCCSC": 725,
      "COCCS": 726,
      "CCOCCNC": 727,
      "OCCCCCCCCC": 728,
      "CCCCCCCOC": 729,
      "Pc": 730,
      "OCCF": 731,
      "CCCCCCCCCCCCOC": 732,
      "Te": 733,
      "+][": 734,
      "78": 735,
      "NCCCCCCC": 736,
      "OCCCCO": 737,
      "CSCCO": 738,
      "CSCCNC": 739,
      "OCCCCOC": 740,
      "OCCCNc": 741,
      "CCCCCCCCCCCCCCCCCCCCCC": 742,
      "SSC": 743,
      "CNCc": 744,
      "OCCCCn": 745,
      "OCCCCCCOc": 746,
      "OCCOCCOCCOC": 747,
      "COCCOCCNC": 748,
      "ncno": 749,
      "CCCCCCCCCCOC": 750,
      "CCOCn": 751,
      "CCCCSC": 752,
      "CCCCCCCCNC": 753,
      "+]#": 754,
      "CCCCCCCCCOC": 755,
      "CSCCCC": 756,
      "46": 757,
      "COCO": 758,
      "IH": 759,
      "(#": 760,
      "COCCCCC": 761,
      "NCCCCn": 762,
      "cocn": 763,
      "COO": 764,
      "NOc": 765,
      "NNCc": 766,
      "NCCCl": 767,
      "Al": 768,
      "98": 769,
      "17": 770,
      "OCCCCCCCCCCCCCCCC": 771,
      "CCCCCCNc": 772,
      "COCCCc": 773,
      "CCNCc": 774,
      "BrCC": 775,
      "CCCCOCCCNC": 776,
      "CCOCCc": 777,
      "CCSS": 778,
      "CCCCBr": 779,
      "COCCOCCC": 780,
      "NSc": 781,
      "CCCP": 782,
      "NCCCCCO": 783,
      "OCCSC": 784,
      "CCCOP": 785,
      "OCCOCCC": 786,
      "NCCCSc": 787,
      "CCOCCCn": 788,
      "OCCCCCCOC": 789,
      "OCCOCCOc": 790,
      "OCCNS": 791,
      "NCl": 792,
      "25": 793,
      "CCCCCCCCCOc": 794,
      "cccccc": 795,
      "CCCCOCCC": 796,
      "NCCCCCCNC": 797,
      "OCCOCc": 798,
      "NCCCCO": 799,
      "NCCCCCCCC": 800,
      "PC": 801,
      "CCI": 802,
      "CCCCCCCNC": 803,
      "CCCCCCCCCCCCCCCCCCCCCCC": 804,
      "conc": 805,
      "COCN": 806,
      "OCCCCc": 807,
      "OCF": 808,
      "SSSS": 809,
      "]([": 810,
      "CNn": 811,
      "OCCBr": 812,
      "COB": 813,
      "18": 814,
      "BrCc": 815,
      "CCCOCCOC": 816,
      "])(": 817,
      "OCCCCCOc": 818,
      "COCCCS": 819,
      "CCCCOP": 820,
      "CCCCCSc": 821,
      "OOOO": 822,
      "+]#[": 823,
      "COn": 824,
      "nocc": 825,
      "COCn": 826,
      "37": 827,
      "cocc": 828,
      "OCCOCCOCCO": 829,
      "]=": 830,
      "CCCCCCCCn": 831,
      "NCCCCN": 832,
      "OCP": 833,
      "CNCCS": 834,
      "OCCCCCCCCCCC": 835,
      "CCCCOCCOCC": 836,
      "NCCCCCc": 837,
      "Hg": 838,
      "CCNN": 839,
      "NCCCCNC": 840,
      "SCCCCC": 841,
      "COOC": 842,
      "OCCCCNC": 843,
      "CCCSCc": 844,
      "NCCF": 845,
      "CCOCCS": 846,
      "CCCCCNS": 847,
      "CCCCOCc": 848,
      "CCCCCCCCCCCCCCCCCCCCCCCC": 849,
      "CCCON": 850,
      "CCCCCCCCCCCCCCOc": 851,
      "NCCCCOc": 852,
      "75": 853,
      "NCCCOCc": 854,
      "CCOCCNc": 855,
      "52": 856,
      "OCNC": 857,
      "NOS": 858,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 859,
      "CCOCCOCCOCCOCCOCC": 860,
      "89": 861,
      "NCNC": 862,
      "CCCCCCCCCCCCCCCCCCOC": 863,
      "CCCCCCCCCCCCCCCCOC": 864,
      "NSC": 865,
      "OCCOCCOCCOCCO": 866,
      "COCCOCc": 867,
      "CCCCCCCCCCCCN": 868,
      "CONCc": 869,
      "CCCCP": 870,
      "CCCCCCOCC": 871,
      "CCCCCCCCCCCCNC": 872,
      "19": 873,
      "CCCNCC": 874,
      "SCCCc": 875,
      "OCCCCN": 876,
      "OOc": 877,
      "COCCOCCOC": 878,
      "NCCCCCCO": 879,
      "OF": 880,
      "51": 881,
      "CCCCCCS": 882,
      "CCCCCBr": 883,
      "CCCCCCCCCCCc": 884,
      "NCCCOCCO": 885,
      "314": 886,
      "OCCCCCCCCCCCCCCCCCC": 887,
      "COCOCC": 888,
      "NCCOCCOCCNC": 889,
      "cnsc": 890,
      "CCCCCCCCCCCCCCOC": 891,
      "SCCOC": 892,
      "SCCCO": 893,
      "ncncn": 894,
      "COCCOCCCC": 895,
      "CSN": 896,
      "OCCCCl": 897,
      "NCCCNS": 898,
      "BB": 899,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 900,
      "ccns": 901,
      "SNC": 902,
      "CCCCCCCCCCCOC": 903,
      "NCCOCc": 904,
      "CCOCCCNc": 905,
      "CCCCCCCCCCCCCCCc": 906,
      "NCCCCSC": 907,
      "20": 908,
      "sncc": 909,
      "NCCCCl": 910,
      "SCCCN": 911,
      "CCCCCOCC": 912,
      "CCCOS": 913,
      "COCCOCCOc": 914,
      "ClCCc": 915,
      "CSCCCNC": 916,
      "CCCCCCCCCCCCCCCCCCCCCCCCC": 917,
      "OOCC": 918,
      "NCS": 919,
      "CCCCSCC": 920,
      "PP": 921,
      "nnns": 922,
      "OCl": 923,
      "CCCCOCCOc": 924,
      "CCCCCCl": 925,
      "CCCCCCCCCCN": 926,
      "CSCCc": 927,
      "CCCCCCCn": 928,
      "SCCCCCC": 929,
      "CCCCCCCCCCNC": 930,
      "OCOCc": 931,
      "CCCCCCCCCCCCCCCCCCNC": 932,
      "CNCCC": 933,
      "SP": 934,
      "NCCCSC": 935,
      "COCCCOC": 936,
      "IC": 937,
      "NCCSCCCO": 938,
      "CCSCCNC": 939,
      "OCCCCCCCCCCCCCC": 940,
      "NCCOCCOC": 941,
      "NCCCCCCCCCCCC": 942,
      "CNOC": 943,
      "COCCOCCOCCOC": 944,
      "CCCOCCOCC": 945,
      "109": 946,
      "CCCCCCCCCCCCCCCCOc": 947,
      "ccsn": 948,
      "CCCCCCCCCCCCCCCCCCN": 949,
      "OCCCCCc": 950,
      "COCCOCCOCCOCCOCC": 951,
      "CCCCCCCCNc": 952,
      "NCCCOCCOC": 953,
      "CSCCOc": 954,
      "CCCI": 955,
      "CCOCCOCCOC": 956,
      "PH": 957,
      "CCCCCCCCCN": 958,
      "NCOc": 959,
      "NCCCOCCOCC": 960,
      "CCCCOCCOC": 961,
      "CSSC": 962,
      "NCCCCOC": 963,
      "CCB": 964,
      "OCCCSc": 965,
      "86": 966,
      "ONc": 967,
      "ssc": 968,
      "-])=[": 969,
      "CSCCn": 970,
      "CCCOCCOc": 971,
      "OCOP": 972,
      "CCCCCCCCCCCCCCCCOCC": 973,
      "nccnn": 974,
      "nscc": 975,
      "NCCOCCC": 976,
      "OCCl": 977,
      "COCCSc": 978,
      "OCCCCCCO": 979,
      "57": 980,
      "-%": 981,
      "OI": 982,
      "NCO": 983,
      "FCC": 984,
      "CCSSCC": 985,
      "SCN": 986,
      "OCCCOCC": 987,
      "OCCOCCOCCOc": 988,
      "CCOCCOCCNC": 989,
      "CCCCCSC": 990,
      "OCCCBr": 991,
      "COCCOCCOCCOc": 992,
      "CCSCCN": 993,
      "SCCn": 994,
      "OCS": 995,
      "36": 996,
      "CCCCCCCCS": 997,
      "OCCCCCO": 998,
      "CCCOCCCO": 999,
      "OCCOP": 1000,
      "BN": 1001,
      "SCCCOc": 1002,
      "OCOCCOC": 1003,
      "OCCOCCOCC": 1004,
      "22": 1005,
      "CCOCOc": 1006,
      "CCCCCCCCCCCCCCc": 1007,
      "CCOCCOCc": 1008,
      "CCCCCCCO": 1009,
      "CCCCCCSc": 1010,
      "OCCCF": 1011,
      "NOCCO": 1012,
      "cnncc": 1013,
      "NCCCSCc": 1014,
      "CCCCOCCNC": 1015,
      "CSCCNc": 1016,
      "CCCCCCCCCCn": 1017,
      "CCCCCCCCCCCCCCCCCCOCC": 1018,
      "CCCCCCCCCNC": 1019,
      "CCNCCS": 1020,
      "NCCCCNc": 1021,
      "FCc": 1022,
      "26": 1023,
      "NCCCOCCOCCOCCCNC": 1024,
      "CCCCCCCCCCCCn": 1025,
      "COCCCNS": 1026,
      "NCn": 1027,
      "CCCCCCCCO": 1028,
      "COCCCCNC": 1029,
      "CCOCO": 1030,
      "CCCCCCCCCCCCCCCOC": 1031,
      "BOC": 1032,
      "NI": 1033,
      "SO": 1034,
      "Sb": 1035,
      "SNc": 1036,
      "CCCCCCCCCCCCCCCCCCOc": 1037,
      "NCCSCC": 1038,
      "CCCOCCO": 1039,
      "SH": 1040,
      "CSS": 1041,
      "CSCS": 1042,
      "NCCCCCNC": 1043,
      "63": 1044,
      "CCNCCC": 1045,
      "CCCCCCCCCCCCCCCCc": 1046,
      "COCCCCOc": 1047,
      "OCCOCCOCCOCCOC": 1048,
      "CNCCN": 1049,
      "CCSCCNc": 1050,
      "OCCSCC": 1051,
      "CCOCOC": 1052,
      "CCCCCCCCCCCCS": 1053,
      "COCCONC": 1054,
      "CCOCN": 1055,
      "OCCCOCc": 1056,
      "OCCCCS": 1057,
      "NNN": 1058,
      "CCCCCCCCCCCCCOC": 1059,
      "NOCCC": 1060,
      "SF": 1061,
      "CSCCCCC": 1062,
      "CCCCCCCCCCCCCc": 1063,
      "CSP": 1064,
      "CCOO": 1065,
      "Pb": 1066,
      "CCCCCCCCOCC": 1067,
      "COCCCCCC": 1068,
      "CCCCCCSC": 1069,
      "CCCCCCCl": 1070,
      "CONc": 1071,
      "CCCCCCCCCCCCCCCCCCc": 1072,
      "CCCCCCCCCn": 1073,
      "CCCCON": 1074,
      "OCCOCCNC": 1075,
      "OCCOCCOCCNC": 1076,
      "CCSCCCC": 1077,
      "CCOCCOCCOCCOCC": 1078,
      "OOOOOOOO": 1079,
      "COCCOCCCNC": 1080,
      "COCCCOCC": 1081,
      "NB": 1082,
      "CCCCB": 1083,
      "SSSSSSSS": 1084,
      "COCCOCOc": 1085,
      "CNP": 1086,
      "CCCCCCCCCCCCCCCCCCCCCCCCCC": 1087,
      "CCCCCCCCCCS": 1088,
      "OCCOS": 1089,
      "CSCCCN": 1090,
      "BH": 1091,
      "NCCCCCOC": 1092,
      "CCCOCCc": 1093,
      "CNOCC": 1094,
      "OSc": 1095,
      "SCCCCCCCC": 1096,
      "CCCCCCNS": 1097,
      "OCCCCCCc": 1098,
      "])[": 1099,
      "CCCCCCBr": 1100,
      "SSCC": 1101,
      "CCCOCCN": 1102,
      "CSCCOC": 1103,
      "62": 1104,
      "COCCCCn": 1105,
      "CCCCCCCCCO": 1106,
      "NCCCCCCN": 1107,
      "CCCCCCCCCCCOc": 1108,
      "CCCCCCCCCCCCO": 1109,
      "CCCCCCCCCCCCCCCCNC": 1110,
      "OOOC": 1111,
      "NCCOCCOCCOCCOCC": 1112,
      "CCCOCCNC": 1113,
      "OCCCCNc": 1114,
      "ClCCC": 1115,
      "OCCCCCOC": 1116,
      "CCCCCOCc": 1117,
      "27": 1118,
      "CCOCCCOc": 1119,
      "CCCCCCCCCOCC": 1120,
      "COCOCc": 1121,
      "COOCC": 1122,
      "CSCCCNc": 1123,
      "SCCNc": 1124,
      "CCCSCCC": 1125,
      "SOC": 1126,
      "SCCSc": 1127,
      "NCOC": 1128,
      "CCCCCCCCCCNc": 1129,
      "CCSSc": 1130,
      "ONN": 1131,
      "NCCBr": 1132,
      "CCOCCCOC": 1133,
      "OCCOCCCC": 1134,
      "CCCCOCCNc": 1135,
      "CNOCc": 1136,
      "CSCCCO": 1137,
      "CCOOC": 1138,
      "CCCCCCCCCS": 1139,
      "SCl": 1140,
      "COCNC": 1141,
      "Op": 1142,
      "CCCCCCCCCCO": 1143,
      "OCCCCOCCCC": 1144,
      "OCCCCCCCCOc": 1145,
      "CSCCSC": 1146,
      "CONS": 1147,
      "CNNc": 1148,
      "CCOCCNS": 1149,
      "28": 1150,
      "pH": 1151,
      "OCCOCCOCCOCCOc": 1152,
      "NCCOCCOCCOC": 1153,
      "CCOCCOCCN": 1154,
      "COCCCCN": 1155,
      "CCCCCCOCc": 1156,
      "CCCCCCCNc": 1157,
      "CCCCOCCCN": 1158,
      "CCOCCOCCOCCOC": 1159,
      "CCCSP": 1160,
      "SCn": 1161,
      "NOCCOc": 1162,
      "COCCOCOC": 1163,
      "CCSCCOc": 1164,
      "OCCOCCOCCOCCOCCO": 1165,
      "CCCCCCCCCCCNC": 1166,
      "CCCOCCCNC": 1167,
      "In": 1168,
      "CCCCF": 1169,
      "OCCCCCN": 1170,
      "CCOCP": 1171,
      "COCCOCCN": 1172,
      "CBc": 1173,
      "OCCCCCCCCCCCCC": 1174,
      "COOCc": 1175,
      "CCCCCCCCCCCCCCCCN": 1176,
      "NCCOP": 1177,
      "CCCCCCCCCCCCSC": 1178,
      "29": 1179,
      "SI": 1180,
      "CCSCCCO": 1181,
      "341": 1182,
      "73": 1183,
      "NCCCCCCCCCCC": 1184,
      "CSCCCCCC": 1185,
      "OBOc": 1186,
      "NCP": 1187,
      "COCCCO": 1188,
      "OCCON": 1189,
      "CCCCCCCCCCCCOCC": 1190,
      "Bi": 1191,
      "CSCCCCNC": 1192,
      "OCCCSCC": 1193,
      "COCCCOCCOc": 1194,
      "CCOCCCc": 1195,
      "CCCNCCS": 1196,
      "OCI": 1197,
      "OCCCCOCC": 1198,
      "CCCCCCCCCCCCCCCCCc": 1199,
      "SCCOCC": 1200,
      "csnc": 1201,
      "CCCOCCn": 1202,
      "NCCCF": 1203,
      "OCCOCCN": 1204,
      "ClCCCc": 1205,
      "48": 1206,
      "SCS": 1207,
      "OCCCCCCNC": 1208,
      "CCOCCCCNC": 1209,
      "CCSCCS": 1210,
      "COCCOCCCOc": 1211,
      "OCCCCCCCCCCOc": 1212,
      "CCOCCOCCOCCOCCNC": 1213,
      "OOCc": 1214,
      "30": 1215,
      "COCP": 1216,
      "OCCCSC": 1217,
      "op": 1218,
      "OCCSS": 1219,
      "COCCCSc": 1220,
      "68": 1221,
      "CCCCI": 1222,
      "CCCOCCCNc": 1223,
      "CCCCOCCCNc": 1224,
      "CCOCCOCCC": 1225,
      "CCCCCCCCCCCCCCCCCOC": 1226,
      "BCC": 1227,
      "NOCCc": 1228,
      "OCCCCBr": 1229,
      "NF": 1230,
      "SCCCn": 1231,
      "CCNNC": 1232,
      "OCCCOP": 1233,
      "47": 1234,
      "]%": 1235,
      "CSCCCCNc": 1236,
      "COCCOCCO": 1237,
      "CSSc": 1238,
      "CCCNN": 1239,
      "CSCCCn": 1240,
      "CCOCCCNS": 1241,
      "NNCCc": 1242,
      "CCCCCCCCCCCO": 1243,
      "CCCCOCCN": 1244,
      "CCOCCCl": 1245,
      "61": 1246,
      "Ga": 1247,
      "OCNc": 1248,
      "COCCCCNc": 1249,
      "OCCSCc": 1250,
      "COCCOCCCOC": 1251,
      "CCCOCCNc": 1252,
      "CCCCOCCOCCNC": 1253,
      "COCCSCC": 1254,
      "COCCCCCNC": 1255,
      "NCCOCCNC": 1256,
      "COCCOCCn": 1257,
      "CCCCCCCS": 1258,
      "OBr": 1259,
      "])=": 1260,
      "CCCOCCCC": 1261,
      "CCSP": 1262,
      "OCCCCCCN": 1263,
      "OSC": 1264,
      "74": 1265,
      "NCNc": 1266,
      "BrCCC": 1267,
      "OCCCCCCCCOC": 1268,
      "COCCOCCNc": 1269,
      "CCOCCOCCO": 1270,
      "CCCCCCP": 1271,
      "132": 1272,
      "+](=[": 1273,
      "NCCSSCCNC": 1274,
      "CCCCOCCn": 1275,
      "CNO": 1276,
      "CSCCCOc": 1277,
      "CCCCCCCCSc": 1278,
      "CCCCCCCCCCCCCCCCS": 1279,
      "SCCCOC": 1280,
      "ss": 1281,
      "CCSSC": 1282,
      "COCCOCCCNc": 1283,
      "pc": 1284,
      "CCNCCN": 1285,
      "CCOCCSc": 1286,
      "CCCCCCCOCC": 1287,
      "COCCCOCCOC": 1288,
      "COOSc": 1289,
      "ICC": 1290,
      "COCCCCCCCCCCCCCCCCCC": 1291,
      "NCCOCCOCCOCCNC": 1292,
      "312": 1293,
      "CCCNCc": 1294,
      "COCCOCCOCCOCCOCCOCCOCCOCCOCC": 1295,
      "CCOn": 1296,
      "SCF": 1297,
      "CCCCCCCCCBr": 1298,
      "NCCCCOCCOC": 1299,
      "CCCCCCCCCCCCCCNC": 1300,
      "ONS": 1301,
      "NCCCBr": 1302,
      "ClP": 1303,
      "CCOB": 1304,
      "CCSCCOC": 1305,
      "COCCOCCOCCOCC": 1306,
      "OCCCCCl": 1307,
      "CCSCCc": 1308,
      "CCCCOS": 1309,
      "NCCCCCCNc": 1310,
      "123": 1311,
      "NCCCCCN": 1312,
      "OOP": 1313,
      "NSN": 1314,
      "NCCCCCCCCNC": 1315,
      "CCSSCCC": 1316,
      "SCSC": 1317,
      "OCCCCCNC": 1318,
      "SCCCCCCCCCCCC": 1319,
      "CCCCSCc": 1320,
      "CCCCCOP": 1321,
      "CCSCCn": 1322,
      "CCSCCCNc": 1323,
      "CCCCCCCCCCCCCCCCNc": 1324,
      "OCCCCCCCCCCCOc": 1325,
      "97": 1326,
      "CNCCc": 1327,
      "CCCCCP": 1328,
      "CSCCCCCNC": 1329,
      "CCCCCCCCCCCCCCN": 1330,
      "CCCCCF": 1331,
      "COCCCCc": 1332,
      "CCCCCCCCCCOCC": 1333,
      "OCCOCCOCCOCCOCCOCCO": 1334,
      "OCSC": 1335,
      "CNCl": 1336,
      "NCCCCOCC": 1337,
      "OCCP": 1338,
      "CCNP": 1339,
      "COOc": 1340,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1341,
      "NCCOCCOCCOCCOCCC": 1342,
      "NCCCCCCCCCC": 1343,
      "OOS": 1344,
      "SCCCl": 1345,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1346,
      "CCCCOCCCCC": 1347,
      "NOP": 1348,
      "ONCC": 1349,
      "CCCCCCCSc": 1350,
      "33": 1351,
      "38": 1352,
      "FCCC": 1353,
      "COCCNCC": 1354,
      "CCCCCCOP": 1355,
      "COCCOCCOCCO": 1356,
      "te": 1357,
      "CCSCCCOc": 1358,
      "OCCOCCOCCOCCC": 1359,
      "OCCCCCCS": 1360,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1361,
      "ONCc": 1362,
      "PCC": 1363,
      "CONCC": 1364,
      "CSNC": 1365,
      "NCCCCCSC": 1366,
      "SeH": 1367,
      "COCCOCCOCCC": 1368,
      "COCCOCCOCCOCCOC": 1369,
      "CCOCCOCCOCCNC": 1370,
      "CSCCCCCNc": 1371,
      "CCCCCCCCSC": 1372,
      "occn": 1373,
      "OCBr": 1374,
      "CCCCSCCC": 1375,
      "SCCNS": 1376,
      "SCCCCl": 1377,
      "COCCCOCCC": 1378,
      "CCCCCCCCP": 1379,
      "NNNC": 1380,
      "OCCCNS": 1381,
      "CCOCCOCCOc": 1382,
      "NCCCOCCc": 1383,
      "OCCOCCOCCN": 1384,
      "NOCCCC": 1385,
      "CCCCCSCC": 1386,
      "COCCOCCc": 1387,
      "CCCCCCCCCCCCCCCCn": 1388,
      "NCCCCCCOC": 1389,
      "NBr": 1390,
      "SCOC": 1391,
      "SCCCNC": 1392,
      "OCCI": 1393,
      "CNNN": 1394,
      "CCCONC": 1395,
      "CSCCCCCCNC": 1396,
      "CCCCCCCCCCCS": 1397,
      "OCCCOCCOC": 1398,
      "CCOSOOO": 1399,
      "CCCB": 1400,
      "CSCCNS": 1401,
      "CCCCCCCCCCCn": 1402,
      "CCCCCCCCCCCCCCOCC": 1403,
      "BCc": 1404,
      "NCCCCCCCCC": 1405,
      "OCCCCCCCCCCCCCCC": 1406,
      "-])-": 1407,
      "COCCCCCNc": 1408,
      "COCCCCCCCC": 1409,
      "OCON": 1410,
      "OSOOO": 1411,
      "NCCOCCS": 1412,
      "CCCOCCCOCCCOCCCO": 1413,
      "OCCOCCCOC": 1414,
      "CCSCCCN": 1415,
      "NCCCCCl": 1416,
      "SSN": 1417,
      "CCCCCON": 1418,
      "NNOC": 1419,
      "NCCCCCNc": 1420,
      "85": 1421,
      "ClCCN": 1422,
      "CCCCCCCOCc": 1423,
      "COCCOCCS": 1424,
      "COCCOCCOCc": 1425,
      "CCCCOCCCC": 1426,
      "CSCOC": 1427,
      "COCCOCCCCNC": 1428,
      "COCCOCCOCCN": 1429,
      "321": 1430,
      "NCCCCCCCCCCCCCCCC": 1431,
      "SCCOP": 1432,
      "OCCCCCS": 1433,
      "OBc": 1434,
      "OON": 1435,
      "CNCCCNC": 1436,
      "COCCCCOC": 1437,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCC": 1438,
      "CCOOCC": 1439,
      "CCSN": 1440,
      "OCCOCCOCCOCCOCCOC": 1441,
      "COCCOCCOCCOCCO": 1442,
      "BP": 1443,
      "NCCCCCCCCCCCCCCCCCC": 1444,
      "scnn": 1445,
      "cnon": 1446,
      "CCCCCCCCOP": 1447,
      "CCOCCCCC": 1448,
      "CCOCCOCCOCCOCCC": 1449,
      "NOCCOC": 1450,
      "PN": 1451,
      "ccocc": 1452,
      "315": 1453,
      "NCCCCCCCl": 1454,
      "Ru": 1455,
      "SCSc": 1456,
      "CCSCCCn": 1457,
      "SSSSSSSSSSSSSSSS": 1458,
      "CCNCCNCC": 1459,
      "NCCI": 1460,
      "CCCCCCCCCCSc": 1461,
      "COCCSC": 1462,
      "OCCCCSc": 1463,
      "NCCOCCOCCC": 1464,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1465,
      "39": 1466,
      "SCCCCCCCCCC": 1467,
      "OCCCCCn": 1468,
      "213": 1469,
      "CCCCCCCCCCCN": 1470,
      "CCSCCO": 1471,
      "CCCCCCCCCCCCNc": 1472,
      "CPC": 1473,
      "NCCCOCCCl": 1474,
      "84": 1475,
      "SOCC": 1476,
      "OBO": 1477,
      "CCCCCCOCCCCc": 1478,
      "CCOCOCC": 1479,
      "NCCOCCCl": 1480,
      "CCCCCCCCCCCCCCCCCCn": 1481,
      "OPOc": 1482,
      "NON": 1483,
      "BO": 1484,
      "CNSc": 1485,
      "CSCCCCCCNc": 1486,
      "CCOCCOCCNc": 1487,
      "OCCCCON": 1488,
      "COCCOCCCCNc": 1489,
      "OOOOOOOOOOOOOOOO": 1490,
      "ClN": 1491,
      "-])(=": 1492,
      "NCCCCBr": 1493,
      "OCCCCCCn": 1494,
      "OCCCCCCCCCCOC": 1495,
      "NCCCCCCSC": 1496,
      "ccccccc": 1497,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCC": 1498,
      "OCCCCCBr": 1499,
      "CCCCCOCCC": 1500,
      "CCCCCCCCCCCCCCCCCCCc": 1501,
      "COCCCCNS": 1502,
      "CCCCOCCOCCOCC": 1503,
      "CCONc": 1504,
      "SSS": 1505,
      "NCCCCCCl": 1506,
      "ClCCCC": 1507,
      "NNCCC": 1508,
      "OCCCCCCOCC": 1509,
      "NCCCCI": 1510,
      "COCCOCCNS": 1511,
      "GeH": 1512,
      "58": 1513,
      "FCCOc": 1514,
      "BrCCc": 1515,
      "CCNCCc": 1516,
      "OCCOCCS": 1517,
      "CCCCCCCCCCCCCCO": 1518,
      "OCCOCCOCCOCCOCCOc": 1519,
      "FN": 1520,
      "CCCOCCCNS": 1521,
      "CCCCCCCCCCCCSc": 1522,
      "OCCCCCCCCCCCCOc": 1523,
      "OCCSSCC": 1524,
      "OCCCCCCCl": 1525,
      "COCCCCCCOc": 1526,
      "ccnnn": 1527,
      "OCCCCCCCCCOc": 1528,
      "NOCCCc": 1529,
      "COCCCCCCCCCCCCCCCC": 1530,
      "CCONCc": 1531,
      "NCCCI": 1532,
      "OCCCCCNc": 1533,
      "COCS": 1534,
      "SSSSC": 1535,
      "OCCSSCCOC": 1536,
      "Cr": 1537,
      "OCCCCCCCCCCCCCCCCC": 1538,
      "COSc": 1539,
      "COOS": 1540,
      "COCCOCCCn": 1541,
      "CCCOCCCN": 1542,
      "OCCCCCCCOc": 1543,
      "COCCCOCc": 1544,
      "BBBB": 1545,
      "40": 1546,
      "59": 1547,
      "CCCCCCCCNS": 1548,
      "SOO": 1549,
      "]=[": 1550,
      "-]([": 1551,
      "CCSCCNS": 1552,
      "SSSC": 1553,
      "NCCOCCBr": 1554,
      "NCCCCCCBr": 1555,
      "CCCCCCOCCC": 1556,
      "CCCCCI": 1557,
      "COCCCCCCCCCCCC": 1558,
      "CCOCCOCCOCCO": 1559,
      "OCCOCCn": 1560,
      "108": 1561,
      "COCCOCCOCCOCCOc": 1562,
      "SCO": 1563,
      "CCCOCCOCCOCCOCC": 1564,
      "CSCSC": 1565,
      "CCCCCCCCOCc": 1566,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1567,
      "OCCOCn": 1568,
      "CSSCCC": 1569,
      "CCCCCCCCCOP": 1570,
      "NCCCCCBr": 1571,
      "CPc": 1572,
      "CCOCS": 1573,
      "CCCOCn": 1574,
      "CCCCCCCCCCCCCCCCCCCCOC": 1575,
      "OCCCON": 1576,
      "Tl": 1577,
      "OCCCCCCBr": 1578,
      "NCCOCCOCCN": 1579,
      "NCCOCCOCCOCCC": 1580,
      "SCCF": 1581,
      "CCCCCCCCCCCCCCCCCCS": 1582,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCNC": 1583,
      "SOc": 1584,
      "SCCCCCCC": 1585,
      "OCCOCCCl": 1586,
      "CCCCCCCP": 1587,
      "OCCOCCNc": 1588,
      "OCCOCCOCCC": 1589,
      "CCCCCCCCCCBr": 1590,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1591,
      "NCCOCCN": 1592,
      "CSCCCc": 1593,
      "CSCCCNS": 1594,
      "NCCCCCI": 1595,
      "NCCCOCCBr": 1596,
      "NNCCO": 1597,
      "SnH": 1598,
      "CCCCCCI": 1599,
      "CCCSOOO": 1600,
      "NCCCCCCI": 1601,
      "OCCOCCOCCCC": 1602,
      "OCCCCCCCCCCCCCCCCCCCC": 1603,
      "CNCCNC": 1604,
      "NCCP": 1605,
      "CSOOO": 1606,
      "NCCCCCOc": 1607,
      "SCCCSc": 1608,
      "CCCCOCCNS": 1609,
      "NCCOCCOCCNc": 1610,
      "79": 1611,
      "OCSc": 1612,
      "CCCCCSCc": 1613,
      "CCCCCCCCCCCCCCCCCCOP": 1614,
      "NCCCCCCCNC": 1615,
      "CCCCCCCCCCCCCO": 1616,
      "OCCCCCCCCCCCOC": 1617,
      "CCOCCOCCOCCN": 1618,
      "CCOCCOCCOCCC": 1619,
      "CCOOCc": 1620,
      "NSCC": 1621,
      "CCCCCCCCCCCCCCCCO": 1622,
      "NCCCCCCn": 1623,
      "OCCCCCCCCCCCCOC": 1624,
      "CCNOC": 1625,
      "COCNc": 1626,
      "NCCOCCOc": 1627,
      "CCCCCCCCCNc": 1628,
      "NOCOC": 1629,
      "432": 1630,
      "SCCCCOc": 1631,
      "CSCCOCC": 1632,
      "COCCCSC": 1633,
      "CCCOCCOCc": 1634,
      "COCCONCc": 1635,
      "SOON": 1636,
      "IN": 1637,
      "COOO": 1638,
      "CSCn": 1639,
      "CSCCCS": 1640,
      "CCOCCCCCC": 1641,
      "OCCCP": 1642,
      "CCCCOCCCNS": 1643,
      "CCOCCOCCOCCOc": 1644,
      "OCCCCOCCCCOCCCCOCCCC": 1645,
      "OCCNCC": 1646,
      "CSNc": 1647,
      "CCOCCOCCn": 1648,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 1649,
      "NOO": 1650,
      "NCCCCCCc": 1651,
      "Bn": 1652,
      "CSn": 1653,
      "CCCCCCCCCCSC": 1654,
      "CCCCCCCCCCCCCCCCSCC": 1655,
      "NCCCCNS": 1656,
      "OCCCOS": 1657,
      "OCCCCCCCCO": 1658,
      "CBC": 1659,
      "SCCCCN": 1660,
      "+])=[": 1661,
      "ccccccccc": 1662,
      "COCOCCC": 1663,
      "CSCCCOC": 1664,
      "CCCNP": 1665,
      "CCCCCCCBr": 1666,
      "CCCCCCCCCCCCCCCO": 1667,
      "OCCCCCCl": 1668,
      "NCCOCCOCCOCC": 1669,
      "COCCOCCOCCNC": 1670,
      "FCOc": 1671,
      "SCCCCCO": 1672,
      "ncnnc": 1673,
      "BrCCCC": 1674,
      "COCSc": 1675,
      "COCCCCCCCCC": 1676,
      "CSCO": 1677,
      "CCCCCCCCCCCCOP": 1678,
      "NCCCCOCc": 1679,
      "NCCNCC": 1680,
      "OCCSCCO": 1681,
      "OCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 1682,
      "OCCOCCON": 1683,
      "SCCCCCCCCCCCCCCCC": 1684,
      "CCCCOCCc": 1685,
      "-]=": 1686,
      "CSSCc": 1687,
      "CSCCCCNS": 1688,
      "SCCl": 1689,
      "CCCCCCCCCCCCCCCCCCO": 1690,
      "SCCCCO": 1691,
      "nncnc": 1692,
      "COCCCl": 1693,
      "CCCCOCCCn": 1694,
      "COCCCCCCC": 1695,
      "CCSCCSCC": 1696,
      "CCCCOCCCCCC": 1697,
      "CCCCCCCCCCCCCCCOc": 1698,
      "49": 1699,
      "CCCSCCCC": 1700,
      "CCCCONC": 1701,
      "OCCCCCCCc": 1702,
      "COCCCCOCC": 1703,
      "COCCCOP": 1704,
      "CSCNC": 1705,
      "CCCOCCCn": 1706,
      "CCCCCCCCCCCCCCCCOP": 1707,
      "CCCCCCCCCCCCCCCCCO": 1708,
      "COCCONS": 1709,
      "72": 1710,
      "CCCCCCCOP": 1711,
      "CSCCCCCNS": 1712,
      "CCONS": 1713,
      "CCCOCCOCCC": 1714,
      "COCCOCCCNS": 1715,
      "OCCCCCCCCCCO": 1716,
      "44": 1717,
      "SBr": 1718,
      "CCNn": 1719,
      "CCCCCOS": 1720,
      "CSOC": 1721,
      "CCSCCCOC": 1722,
      "NCCCCCCOc": 1723,
      "NCCSSCC": 1724,
      "COCCOCn": 1725,
      "CCCCNCC": 1726,
      "CNCS": 1727,
      "COCCOP": 1728,
      "COCCON": 1729,
      "COCCCSCC": 1730,
      "COCCOCCOCCOCCOCCO": 1731,
      "CCOCCOCCOCCNc": 1732,
      "NCCCCCCCCCCCCCC": 1733,
      "CCCOCCOCCOC": 1734,
      "CCCCCCCCCCOP": 1735,
      "COCCCCCn": 1736,
      "CCCCCCCCCCCCSCC": 1737,
      "OCCCOCCC": 1738,
      "NOCF": 1739,
      "SCCCSC": 1740,
      "FP": 1741,
      "NOCCCOc": 1742,
      "SCCOCCO": 1743,
      "])([": 1744,
      "CCNCCO": 1745,
      "NCCl": 1746,
      "231": 1747,
      "CCSCCCNC": 1748,
      "COCCCOCCN": 1749,
      ")#": 1750,
      "cccoc": 1751,
      "OCCCCCOCC": 1752,
      "COCCCCS": 1753,
      "CCCCCCCCCCCCCOc": 1754,
      "CCCCOCCOCc": 1755,
      "OCCSSc": 1756,
      "96": 1757,
      "FCCn": 1758,
      "SCCCCS": 1759,
      "ncsn": 1760,
      "BrCCN": 1761,
      "CSCCCCN": 1762,
      "COCCSCc": 1763,
      "COCCCCCNS": 1764,
      "COCCCOCCn": 1765,
      "FS": 1766,
      "NOCCNC": 1767,
      "OOCCC": 1768,
      "SCSCS": 1769,
      "NCCON": 1770,
      "CSCCSCC": 1771,
      "CSCCCCn": 1772,
      "CCOCCBr": 1773,
      "NCCCCS": 1774,
      "CCCOCCCCC": 1775,
      "NCCSSc": 1776,
      "COCCOCCCN": 1777,
      "NCCOCCOCCNS": 1778,
      "COCCOCCOCCn": 1779,
      "COCCOCCOCCOCCC": 1780,
      "POC": 1781,
      "SOOC": 1782,
      "CCCNNC": 1783,
      "CCSCCCS": 1784,
      "CCCCCCCCCCCOCC": 1785,
      "OCCCCCCCCc": 1786,
      "NCCCCCCCCCCCCNC": 1787,
      "POc": 1788,
      "SCCCOCC": 1789,
      "OCCCCCSc": 1790,
      "cncnn": 1791,
      "OCCCCOCc": 1792,
      "CCCCCCCCCCCCNS": 1793,
      "CCCCOCN": 1794,
      "CSCCCSC": 1795,
      "OCCOCCOCCOCCNC": 1796,
      "OCCOCCOCCOCCOCCOCCOC": 1797,
      "NOCCF": 1798,
      "COCCOCCOCCOCc": 1799,
      "OCCCCCCCOC": 1800,
      "OCCCCCCCCCl": 1801,
      "713": 1802,
      "SSCCC": 1803,
      "NCOCC": 1804,
      "COCCF": 1805,
      "OCOS": 1806,
      "CCCCCCCSC": 1807,
      "NCCCCCCOP": 1808,
      "conn": 1809,
      "OCCOCCOCCOCCOCC": 1810,
      "CCOCCOCCOCCOCCOC": 1811,
      "np": 1812,
      "COCCCCCCCCCC": 1813,
      "NCCOS": 1814,
      "CCSSCCN": 1815,
      "NNNN": 1816,
      "CCCOO": 1817,
      "CCCCOn": 1818,
      "CCCCCCCCCCCCCNC": 1819,
      "BNC": 1820,
      "Mo": 1821,
      "SCOCC": 1822,
      "cp": 1823,
      "OCOCCC": 1824,
      "ClB": 1825,
      "CCNNc": 1826,
      "COCON": 1827,
      "CCCCCCCCBr": 1828,
      "CCOCCOCCCC": 1829,
      "OCCCNCc": 1830,
      "CCCCNP": 1831,
      "CCCCCCCCCSc": 1832,
      "CCCCOOC": 1833,
      "COCCOCN": 1834,
      "COCCOCOCC": 1835,
      "NCCOCCOCCOCCOC": 1836,
      "NCCCCCCCCCCNC": 1837,
      "PCc": 1838,
      "SCNC": 1839,
      "SCCCCc": 1840,
      "CNSC": 1841,
      "OCCCSCc": 1842,
      "OCCOCCc": 1843,
      "CCCCCCCCCCCCCCCCCCCCc": 1844,
      "NCCCCOCCc": 1845,
      "OSN": 1846,
      "107": 1847,
      "CCCCCCCCCCCCCCn": 1848,
      "CCCCCCCCCCCCCCCn": 1849,
      "SSCc": 1850,
      "CCCOCCOCCOCCOCCOCCOCCOCCOCC": 1851,
      "CNCCO": 1852,
      "COOP": 1853,
      "CSCCSc": 1854,
      "CCONCC": 1855,
      "OCCCI": 1856,
      "OCCCCNS": 1857,
      "CCCCCCCCCCCCP": 1858,
      "NCCCCCNS": 1859,
      "CCPC": 1860,
      "ICc": 1861,
      "SCCCCCn": 1862,
      "CNI": 1863,
      "OPP": 1864,
      "OCCCCCCNc": 1865,
      "CSCCCCCCNS": 1866,
      "COCCOCCCOCC": 1867,
      "81": 1868,
      "SCCCCCCCCCCCCCCCCCC": 1869,
      "CCOOP": 1870,
      "NSNC": 1871,
      "CNSN": 1872,
      "CCCCCCCCCCCCCCCNC": 1873,
      "COCCOCCCOCc": 1874,
      "NCCCOCCOCCOCCC": 1875,
      "95": 1876,
      "SCCCCCCCCC": 1877,
      "onnc": 1878,
      "NCSCC": 1879,
      "BrCCCc": 1880,
      "COCCCCCOc": 1881,
      "CCNCl": 1882,
      "cnno": 1883,
      "CCCOn": 1884,
      "NOOSc": 1885,
      "CCCCCCCCCCP": 1886,
      "NCCCCCn": 1887,
      "NCCOCCOCCOCCN": 1888,
      "OCCCCCCCCCOC": 1889,
      "CCCCCCCCCCCCOS": 1890,
      "FB": 1891,
      "FCCCNc": 1892,
      "PI": 1893,
      "SCCCCCc": 1894,
      "CCCCCCSCC": 1895,
      "NSCc": 1896,
      "CCCCCCCCCCCCCCCCCCCCCCOC": 1897,
      "OOSc": 1898,
      "CCCCSP": 1899,
      "118": 1900,
      "COCCOCNC": 1901,
      "SSCCCC": 1902,
      "SSSc": 1903,
      "COCCOCCOCCOCCNC": 1904,
      "NOCCCCC": 1905,
      "SNCC": 1906,
      "NCSC": 1907,
      "COCSC": 1908,
      "NCCOCCn": 1909,
      "CCCCCCCCON": 1910,
      "CCCCCCCCCCCCCN": 1911,
      "COCCCCCN": 1912,
      "CCSCCCCC": 1913,
      "OCCOCCF": 1914,
      "CCCCCCCCCCCCCCCCCCCCOc": 1915,
      "COCCCSCc": 1916,
      "COCCCOCCOCC": 1917,
      "NCCNP": 1918,
      "CCCOCCCc": 1919,
      "71": 1920,
      "PO": 1921,
      "SCCCCCCCCCCC": 1922,
      "Zr": 1923,
      "coccc": 1924,
      "NCSc": 1925,
      "CCCCNN": 1926,
      "COI": 1927,
      "OCCCCOP": 1928,
      "COCCCCCCOC": 1929,
      "OCCSSCCO": 1930,
      "cnnnc": 1931,
      "CCOCCCS": 1932,
      "OCCCCCCOP": 1933,
      "AsH": 1934,
      "FCCNc": 1935,
      "OCCCCCCCCCCCCCCCCCCCCCC": 1936,
      "ssnc": 1937,
      "+]%": 1938,
      "CNCCCC": 1939,
      "CCOCOCc": 1940,
      "CCCNn": 1941,
      "CCSSCCNC": 1942,
      "CCCOCOC": 1943,
      "CCCSSC": 1944,
      "OOOOC": 1945,
      "OCOCOCOC": 1946,
      "OCCCCCCCCCCCS": 1947,
      "NCCOCCOCCO": 1948,
      "NCCCOCCC": 1949,
      "CCOCCOCCOCCOCCOCCC": 1950,
      "Fe": 1951,
      "occcc": 1952,
      "CCCCCCON": 1953,
      "CCCCCCCOCCC": 1954,
      "ClCCCCC": 1955,
      "129": 1956,
      "CSCOc": 1957,
      "CSCSCC": 1958,
      "CCCCCCCCOCCC": 1959,
      "CCCOOC": 1960,
      "NCCCP": 1961,
      "OCCOCCOCc": 1962,
      "NONC": 1963,
      "COCCCOCCOCc": 1964,
      "OSO": 1965,
      "CCCCCCCCCCCCCCCS": 1966,
      "OCCCCCCCCCCCCO": 1967,
      "NCCOCCOCCOCCn": 1968,
      "BBB": 1969,
      "CCCOCCOCCOCCCNC": 1970,
      "50": 1971,
      "OSCC": 1972,
      "])=[": 1973,
      "CCCOCCCCCC": 1974,
      "CCCCCCCCCCCCCCCCCCSCC": 1975,
      "NCCCCSc": 1976,
      "CCCCCCCCCCCCCCCN": 1977,
      "OCOCOC": 1978,
      "SSSSc": 1979,
      "NCCCOP": 1980,
      "SCCCCCCO": 1981,
      "NCCOCCOCCCCCCCl": 1982,
      "OCCOCCOCCOCCCC": 1983,
      "CCCCOCCOCCOCCC": 1984,
      "COCCOCCOCCOCCOCCOC": 1985,
      "CCCCOCCOCCOC": 1986,
      "OCCNN": 1987,
      "CNCCNCC": 1988,
      "CCOCSc": 1989,
      "CCCCCCCCCCNS": 1990,
      "CCOCCSC": 1991,
      "CCSCCSc": 1992,
      "NNP": 1993,
      "OCOO": 1994,
      "OCCOCCOCCOCc": 1995,
      "CCCSCCCNC": 1996,
      "NCCOCCOCCOc": 1997,
      "NCB": 1998,
      "CCCCCCOS": 1999,
      "BrN": 2000,
      "COCCCCCCCCCCCCCC": 2001,
      "COCCCCCc": 2002,
      "COCCCCCCc": 2003,
      "OCCCCCCCO": 2004,
      "CCCCCCCCCCCCCCCCCCCn": 2005,
      "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC": 2006,
      "CCCCOB": 2007,
      "CCCCCCCCCCCCCCCCCNC": 2008,
      "NCCCOCCOCCO": 2009,
      "COCCOCCOCCOCCn": 2010,
      "SCCCCSc": 2011,
      "CCOCCOCCOCCOCCO": 2012,
      "BCCCCC": 2013,
      ")(=[": 2014,
      "CNNCc": 2015,
      "CSSS": 2016,
      "SCCBr": 2017,
      "OCCOCCSC": 2018,
      "CCCOCN": 2019,
      "CCCSN": 2020,
      "CCCCCCCCCCCCCCCCCCNc": 2021,
      "CCCCCCCCCCCCCCS": 2022,
      "CCCCCCCCCCCCCCOP": 2023,
      "CCCCCCCCCCCCCn": 2024,
      "NCCOCCOCCOCCNS": 2025,
      "COCCOCCOCCNc": 2026,
      "COCCOCCOCCOCCN": 2027,
      "CCCOCCOCCOCC": 2028,
      "ICCC": 2029,
      "OOCCCC": 2030,
      "POCC": 2031,
      "SB": 2032,
      "CNNCC": 2033,
      "COSC": 2034,
      "CCCOCCCOC": 2035,
      "OCCCCSC": 2036,
      "CCCCCCCCCCCCCCCCSC": 2037,
      "CCCCCCCCCCCCCCCCCCSC": 2038,
      "103": 2039,
      "CCCOCCNS": 2040,
      "CCCCCCCCCCCCCOCC": 2041,
      "NCCCCCCCCNc": 2042,
      "SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS": 2043,
      "69": 2044,
      "82": 2045,
      "SCCCNc": 2046,
      "CCCOCCOCCOCCOC": 2047,
      "OCCSCCC": 2048,
      "BrP": 2049,
      "CCNCCCC": 2050,
      "CNOc": 2051,
      "CCCCCOCCCC": 2052,
      "CSOc": 2053,
      "CSCCCCCCn": 2054,
      "CCSOOO": 2055,
      "OCCONC": 2056,
      "OCCOCCCCCC": 2057,
      "431": 2058,
      "CCCCCCCCCCCCCCCCCCSc": 2059,
      "CCCCCCCCCCCCCCCCOCCCOP": 2060,
      "NCCCCCCS": 2061,
      "OCCCOCCCOC": 2062,
      "OCCCCCCCCCCCO": 2063,
      "SSCCNC": 2064,
      "COCCOCCOCCS": 2065,
      "OCCCCCCCCCCBr": 2066,
      "CCNCCNCCNCC": 2067,
      "NCCCCCCCCCCCCC": 2068,
      "CCCOCO": 2069,
      "CNCCCO": 2070,
      "COCCCCCCCCCCC": 2071,
      "COCCCCCOCC": 2072,
      "234": 2073,
      "OCCOOC": 2074,
      "OCCOOCCO": 2075,
      "NCCSSC": 2076,
      "SCCCF": 2077,
      "NOCCN": 2078,
      "OSCc": 2079,
      "NCBr": 2080,
      "ClCCCOc": 2081,
      "CCNOCC": 2082,
      "CCNCCCc": 2083,
      "CCCCCCCCSCC": 2084,
      "CCCCCCCCOS": 2085,
      "COCCOCCCCn": 2086,
      "CCSCCCc": 2087,
      "OCCOCCOCCn": 2088,
      "CCCCCCCCCSC": 2089,
      "CCCSSc": 2090,
      "CCCSSCC": 2091,
      "NCCSCCCOC": 2092,
      "CCCCCCCCCCCCCCCCCN": 2093,
      "CCCCCCCCCCCCCCCCCn": 2094,
      "OCCOCCOP": 2095,
      "FCCCC": 2096,
      "FCCCOc": 2097,
      "NCCCCCCCCN": 2098,
      "CCCOCCOCCOc": 2099,
      "ClCCCCc": 2100,
      "BrCCCCC": 2101,
      "CCNO": 2102,
      "CNCN": 2103,
      "nncnn": 2104,
      "COCCOS": 2105,
      "NNCl": 2106,
      "OCCOO": 2107,
      "CCCCCCCCCP": 2108,
      "CCCSS": 2109,
      "NOCCCCCC": 2110,
      "OSOC": 2111,
      "CCOCCOCCOCCOCCN": 2112,
      "OCCCCCCCCCS": 2113,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCNC": 2114,
      "Pt": 2115,
      "SOOc": 2116,
      "CCCCOCCOCCOCCOCC": 2117,
      "ClCCOc": 2118,
      "CCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCC": 2119,
      "COCCOCCCCC": 2120,
      "CCOOc": 2121,
      "CCOCCCO": 2122,
      "CCCOB": 2123,
      "OCCOCCOCCF": 2124,
      "OCCCCOS": 2125,
      "CCCSCCO": 2126,
      "CCCCCCCCCCCCCCCCCCCCCCOc": 2127,
      "119": 2128,
      "COCCONCC": 2129,
      "CCCCOCCOCCC": 2130,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCOCCC": 2131,
      "FCCc": 2132,
      "NCCCCCCCCCCCCCCC": 2133,
      "cH": 2134,
      "ooc": 2135,
      "NCNS": 2136,
      "CNON": 2137,
      "CSCCCCCn": 2138,
      "CCOCNC": 2139,
      "COCCP": 2140,
      "NSS": 2141,
      "CCCCCCF": 2142,
      "OCCCSCCC": 2143,
      "COCCCOCCNc": 2144,
      "CCCCCCCCCCCBr": 2145,
      "CCCCCCCCCCCSC": 2146,
      "CCCOCCS": 2147,
      "CCCOCCOCCO": 2148,
      "CCCCCCCCCCCCCCP": 2149,
      "CCCCCCCCCCCCCCNc": 2150,
      "OCCCCCCCCBr": 2151,
      "CCPCCC": 2152,
      "CCOCCOCCOCCOCCOCCOCCO": 2153,
      "NCCOCCOCCOCCOCCOCCOCCOCCOCCC": 2154,
      "CCCOCCCOCCCOCCCOCCCOCCCOCCCOCCCO": 2155,
      "cccccccc": 2156,
      "CSO": 2157,
      "CSCCCCCCCCCCCC": 2158,
      "CCCCCCCCCCCNc": 2159,
      "CCOCCCOCCC": 2160,
      "CCCCCCCCCCCCCCCOCC": 2161,
      "COCCCCCCOCC": 2162,
      "NCCCON": 2163,
      "OCCOCCOCCOCCOCCOCCOCCOCCOC": 2164,
      "COBNC": 2165,
      "CCOCCOCCOCCOCCOCCOC": 2166,
      "PPP": 2167,
      "FOC": 2168,
      "OH": 2169,
      "PCl": 2170,
      "ClCCOC": 2171,
      "CNCCCN": 2172,
      "COCCCCO": 2173,
      "nnoc": 2174,
      "CSSCCOC": 2175,
      "CCCCCCCCCCCOP": 2176,
      "COCCOCCCS": 2177,
      "CCSNc": 2178,
      "cssc": 2179,
      "OCCOCCSc": 2180,
      "CCCSCCN": 2181,
      "CCCSSCCC": 2182,
      "CCCCCCCCCCCCCCCCSc": 2183,
      "CCCCCCCCCCCCCCCCCCCCCCO": 2184,
      "OPO": 2185,
      "CCCCOCOC": 2186,
      "106": 2187,
      "NCCSS": 2188,
